assignment2/webapp-development/trello/app/views/boards/home.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
        <h6 class="card-subtitle mb-2 text-body-secondary"><%= board.created_at.strftime("%d/%m/%Y") %></h6>
        <h6 class="card-subtitle mb-2 text-body-secondary"><%= User.find(board.user_id).name %></h6>