assignment2/webapp-development/trello/app/views/boards/show.html.erb

SELECT "states".* FROM "states" WHERE "states"."board_id" = $1  [["board_id", 15]]
---
      <div class="row">
        <% @board.states.each do |state| %>

SELECT "tasks".* FROM "tasks" WHERE "tasks"."state_id" = $1  [["state_id", 57]]
---
                <h6 class="card-title"><%= state.name %></h6>
                <% state.tasks.each do |task| %>