assignment2/webapp-development/trello/app/views/boards/show.html.erb

      <span style="font-weight: bold; font-size: 20px; margin-left: 10px"><%= @board.name %></span>
      <% @board.labels.each do |label| %>
---
SELECT "labels".* FROM "labels" WHERE "labels"."board_id" = $1  [["board_id", 16]]