assignment2/webapp-development/trello/app/views/static_pages/table.html.erb

      <tbody>
        <% Board.all.each_with_index do |board, index| %>
---
SELECT "boards".* FROM "boards"