assignment2/webapp-development/trello/app/controllers/boards_controller.rb

SELECT "boards".* FROM "boards" ORDER BY "boards"."created_at" DESC LIMIT $1  [["LIMIT", 3]]
---
  def home
    @boards_limited = Board.order(created_at: :desc).limit(3)

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    id = params['id']
    @board = Board.find(id)